In [134]:
import numpy as np
import pandas as pd

In [135]:
df = pd.DataFrame(
    np.arange(1,13).reshape(3,4),
    columns = ['a','b','c','d']
)
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [136]:
#删除a列
df.drop('a',axis=1)

    b   c   d
0   2   3   4
1   6   7   8
2  10  11  12

In [137]:
#跨列求平均值
df.mean(axis=1)

0     2.5
1     6.5
2    10.5
dtype: float64

In [138]:
#跨行求平均值
df.mean(axis=0)

a    5.0
b    6.0
c    7.0
d    8.0
dtype: float64

## 连接表格

In [139]:
df1 = pd.read_excel("./data/member.xlsx")
a = df1.copy()
a

  userid  age
0      a   23
1      b   46
2      c   32
3      d   19

In [140]:
df2 = pd.read_excel("./data/sale.xlsx")
df2

  userid  payment
0      a     2000
1      c     3500

### 内连接，以两张表的userid的交集进行拼接
没有交集的不显示

In [141]:
df1.merge(df2,how='inner',on='userid')

  userid  age  payment
0      a   23     2000
1      c   32     3500

In [142]:
df3 = pd.read_excel("./data/sale2.xlsx")
b = df3.copy()

### 左连接，以两张表的userid的交集进行拼接，保留所有左表元素

In [143]:
df1.merge(df3,how='left',on = "userid")

  userid  age  payment
0      a   23   2000.0
1      a   23    500.0
2      b   46   1000.0
3      c   32   3500.0
4      d   19      NaN

In [144]:
df4 = pd.read_excel("./data/sale3.xlsx")
df4

  userid  payment
0      a     2000
1      c     3500
2      e      600

## 右连接，以两张表的userid的交集进行拼接，保留所有右表元素

In [145]:
df1.merge(df3,how='right',on = "userid")

  userid  age  payment
0      a   23     2000
1      c   32     3500
2      a   23      500
3      b   46     1000

### 万能公式
pd.merge(df1,df2,on=['key1'],how='inner')
取两个列表中共有的列标题进行合并

In [146]:
pd.merge(df1,df4,on='userid',how='outer')

  userid   age  payment
0      a  23.0   2000.0
1      b  46.0      NaN
2      c  32.0   3500.0
3      d  19.0      NaN
4      e   NaN    600.0

## concat合并

In [147]:
import numpy as np

In [148]:
df1 = np.arange(1,25).reshape(4,6)
df2 = np.arange(25,49).reshape(4,6)

In [149]:
df1 = pd.DataFrame(df1)

In [150]:
df2 = pd.DataFrame(df2)

### 基于行合并
使用concat方式，默认进行行合并

In [151]:
data = pd.concat([df1,df2],axis=0)
data

    0   1   2   3   4   5
0   1   2   3   4   5   6
1   7   8   9  10  11  12
2  13  14  15  16  17  18
3  19  20  21  22  23  24
0  25  26  27  28  29  30
1  31  32  33  34  35  36
2  37  38  39  40  41  42
3  43  44  45  46  47  48

## 基于列合并

In [152]:
data = pd.concat([df1,df2],axis=1)
data

    0   1   2   3   4   5   0   1   2   3   4   5
0   1   2   3   4   5   6  25  26  27  28  29  30
1   7   8   9  10  11  12  31  32  33  34  35  36
2  13  14  15  16  17  18  37  38  39  40  41  42
3  19  20  21  22  23  24  43  44  45  46  47  48

In [153]:
data.loc[0,:]

0     1
1     2
2     3
3     4
4     5
5     6
0    25
1    26
2    27
3    28
4    29
5    30
Name: 0, dtype: int32

In [154]:
data.index

RangeIndex(start=0, stop=4, step=1)

## groupby分组

In [155]:
df1 = pd.read_excel('./data/group.xlsx')
df1

  company  salary  age
0       C      43   35
1       C      17   25
2       C       8   30
3       A      20   22
4       B      10   17
5       B      21   40
6       A      23   33
7       C      49   19
8       B       8   30

In [156]:
a = df1.groupby('company')
a = list(a)
a

[('A',
    company  salary  age
  3       A      20   22
  6       A      23   33),
 ('B',
    company  salary  age
  4       B      10   17
  5       B      21   40
  8       B       8   30),
 ('C',
    company  salary  age
  0       C      43   35
  1       C      17   25
  2       C       8   30
  7       C      49   19)]

### agg聚合函数

使用agg函数求每个元素的均值

In [157]:
df1.groupby('company').agg('mean')

         salary    age
company
A         21.50  27.50
B         13.00  29.00
C         29.25  27.25

## 使用agg对不同列求不同的值
agg可以接收一个字典作为参数，键为要操作的列，值为需要执行的操作
df.groupby('company').agg({'salary':'max','age':'min'})

In [160]:
df1.groupby('company').agg({'salary':'max','age':'min'})

         salary  age
company
A            23   22
B            21   17
C            49   19

## 使用transform新增一列数据

In [161]:
df1

  company  salary  age
0       C      43   35
1       C      17   25
2       C       8   30
3       A      20   22
4       B      10   17
5       B      21   40
6       A      23   33
7       C      49   19
8       B       8   30

In [163]:
#先按照company列分组，计算salary列的平均值，添加到新列
df1['avg_salary'] = df1.groupby('company')['salary'].transform('mean')
df1

  company  salary  age  avg_salary
0       C      43   35       29.25
1       C      17   25       29.25
2       C       8   30       29.25
3       A      20   22       21.50
4       B      10   17       13.00
5       B      21   40       13.00
6       A      23   33       21.50
7       C      49   19       29.25
8       B       8   30       13.00